# Задача 2. Найти сумму цифр трехзначного числа

a = int(input("Введите трехзначное число: "))
n = a % 10
m = a // 100
k = a // 10 % 10
print(m, "+", k, "+", n, "=", m + k + n)